Revit 2027 API
StructuralSectionGeneralT.SlopedWebAngle Property
 Sloped web angle. (rad)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SlopedWebAngle { get; set; }
Public Property SlopedWebAngle As Double
	Get
	Set
public:
property double SlopedWebAngle {
	double get ();
	void set (double value);
}
member SlopedWebAngle : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionGeneralT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace